sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.h
/*!
    \file    gd32a7xx_linflexd_lin.h
    \brief   definitions for the LINFLEXD LIN

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_LINFLEXD_LIN_H
#define GD32A7XX_LINFLEXD_LIN_H

#include "gd32a7xx.h"

/* peripheral definitions */
/* peripheral base addresses */
#define LINFLEXD_LIN0           (LINFLEXD_BASE + 0x8000U)    /*!< LINFlexD0 base address */
#define LINFLEXD_LIN1           (LINFLEXD_BASE + 0x8400U)    /*!< LINFlexD1 base address */
#define LINFLEXD_LIN2           (LINFLEXD_BASE + 0x8800U)    /*!< LINFlexD2 base address */
#define LINFLEXD_LIN3           (LINFLEXD_BASE + 0x8C00U)    /*!< LINFlexD3 base address */
#define LINFLEXD_LIN4           (LINFLEXD_BASE + 0x9000U)    /*!< LINFlexD4 base address */
#define LINFLEXD_LIN5           (LINFLEXD_BASE + 0x9400U)    /*!< LINFlexD5 base address */

#define LINFLEXD_LIN6           (LINFLEXD_BASE)              /*!< LINFlexD6 base address */
#define LINFLEXD_LIN7           (LINFLEXD_BASE + 0x0400U)    /*!< LINFlexD7 base address */
#define LINFLEXD_LIN8           (LINFLEXD_BASE + 0x0800U)    /*!< LINFlexD8 base address */
#define LINFLEXD_LIN9           (LINFLEXD_BASE + 0x0C00U)    /*!< LINFlexD9 base address */
#define LINFLEXD_LIN10          (LINFLEXD_BASE + 0x1000U)    /*!< LINFlexD10 base address */
#define LINFLEXD_LIN11          (LINFLEXD_BASE + 0x1400U)    /*!< LINFlexD11 base address */

/* registers definitions */
#define LINFLEXD_LINCR1(linflexdx)    REG32((linflexdx) + 0x00000000U)              /*!< LIN control register 1 */
#define LINFLEXD_LINIER(linflexdx)    REG32((linflexdx) + 0x00000004U)              /*!< LIN interrupt enable register */
#define LINFLEXD_LINSR(linflexdx)     REG32((linflexdx) + 0x00000008U)              /*!< LIN status register */
#define LINFLEXD_LINESR(linflexdx)    REG32((linflexdx) + 0x0000000CU)              /*!< LIN error status register */
#define LINFLEXD_LINTCSR(linflexdx)   REG32((linflexdx) + 0x00000018U)              /*!< LIN timeout control status register */
#define LINFLEXD_LINOCR(linflexdx)    REG32((linflexdx) + 0x0000001CU)              /*!< LIN output compare register */
#define LINFLEXD_LINTOCR(linflexdx)   REG32((linflexdx) + 0x00000020U)              /*!< LIN timeout control register */
#define LINFLEXD_LINFBRR(linflexdx)   REG32((linflexdx) + 0x00000024U)              /*!< LIN fractional baud rate register */
#define LINFLEXD_LINIBRR(linflexdx)   REG32((linflexdx) + 0x00000028U)              /*!< LIN integer baud rate register */
#define LINFLEXD_LINCFR(linflexdx)    REG32((linflexdx) + 0x0000002CU)              /*!< LIN checksum field register */
#define LINFLEXD_LINCR2(linflexdx)    REG32((linflexdx) + 0x00000030U)              /*!< LIN control register 2 */
#define LINFLEXD_BIDR(linflexdx)      REG32((linflexdx) + 0x00000034U)              /*!< LIN buffer identifier register */
#define LINFLEXD_BDRL(linflexdx)      REG32((linflexdx) + 0x00000038U)              /*!< LIN buffer data register least significant */
#define LINFLEXD_BDRM(linflexdx)      REG32((linflexdx) + 0x0000003CU)              /*!< LIN buffer data register most significant */
#define LINFLEXD_IFER(linflexdx)      REG32((linflexdx) + 0x00000040U)              /*!< LIN identifier filter enable register */
#define LINFLEXD_IFMI(linflexdx)      REG32((linflexdx) + 0x00000044U)              /*!< LIN identifier filter match index */
#define LINFLEXD_IFMR(linflexdx)      REG32((linflexdx) + 0x00000048U)              /*!< LIN identifier filter mode register */
#define LINFLEXD_IFCR(linflexdx, n)   REG32((linflexdx) + 0x0000004CU + (n) * 0x4U) /*!< LIN identifier filter control register */
#define LINFLEXD_GCR(linflexdx)       REG32((linflexdx) + 0x0000008CU)              /*!< LIN global control register */
#define LINFLEXD_DMATXE(linflexdx)    REG32((linflexdx) + 0x00000098U)              /*!< LIN DMA Tx enable register */
#define LINFLEXD_DMARXE(linflexdx)    REG32((linflexdx) + 0x0000009CU)              /*!< LIN DMA Rx enable register */
#define LINFLEXD_LIN_STCTL(linflexdx) REG32((linflexdx) + 0x000000A0U)              /*!< LIN stop control register */

/* bits definitions */

/* LINFLEXD_LINCR1 */
#define LINFLEXD_LINCR1_INIT          BIT(0)                               /*!< initialization mode request */
#define LINFLEXD_LINCR1_SLEEP         BIT(1)                               /*!< sleep mode request */
#define LINFLEXD_LINCR1_RBLM          BIT(2)                               /*!< receiver buffer locked mode */
#define LINFLEXD_LINCR1_SSBL          BIT(3)                               /*!< slave mode sync break length */
#define LINFLEXD_LINCR1_MME           BIT(4)                               /*!< master mode enable */
#define LINFLEXD_LINCR1_LBKM          BIT(5)                               /*!< loop back mode */
#define LINFLEXD_LINCR1_BF            BIT(7)                               /*!< bypass filter */
#define LINFLEXD_LINCR1_MBL           BITS(8, 11)                          /*!< master break length */
#define LINFLEXD_LINCR1_AUTOWU        BIT(12)                              /*!< automatic wake-up */
#define LINFLEXD_LINCR1_LASE          BIT(13)                              /*!< LIN autosynchronization enable */
#define LINFLEXD_LINCR1_CFD           BIT(14)                              /*!< checksum field disable */
#define LINFLEXD_LINCR1_CCD           BIT(15)                              /*!< checksum calculation disable */
#define LINFLEXD_LINCR1_NLSE          BIT(16)                              /*!< LIN state capture enable on bit error */

/* LINFLEXD_LINIER */
#define LINFLEXD_LINIER_HRIE          BIT(0)                               /*!< header received interrupt enable */
#define LINFLEXD_LINIER_DTIE          BIT(1)                               /*!< data transmitted interrupt enable */
#define LINFLEXD_LINIER_DRIE          BIT(2)                               /*!< data reception complete interrupt enable */
#define LINFLEXD_LINIER_TOIE          BIT(3)                               /*!< timeout interrupt enable */
#define LINFLEXD_LINIER_WUIE          BIT(5)                               /*!< wakeup interrupt enable */
#define LINFLEXD_LINIER_LSIE          BIT(6)                               /*!< LIN state interrupt enable */
#define LINFLEXD_LINIER_BOIE          BIT(7)                               /*!< buffer overrun interrupt enable */
#define LINFLEXD_LINIER_FEIE          BIT(8)                               /*!< frame error interrupt enable */
#define LINFLEXD_LINIER_HEIE          BIT(11)                              /*!< header error interrupt enable */
#define LINFLEXD_LINIER_CEIE          BIT(12)                              /*!< checksum error interrupt enable */
#define LINFLEXD_LINIER_BEIE          BIT(13)                              /*!< bit error interrupt enable */
#define LINFLEXD_LINIER_OCIE          BIT(14)                              /*!< output compare interrupt enable */
#define LINFLEXD_LINIER_SZIE          BIT(15)                              /*!< stuck at zero interrupt enable */

/* LINFLEXD_LINSR */
#define LINFLEXD_LINSR_HRF            BIT(0)                               /*!< header received flag */
#define LINFLEXD_LINSR_DTF            BIT(1)                               /*!< data transmission completed flag */
#define LINFLEXD_LINSR_DRF            BIT(2)                               /*!< data reception completed flag */
#define LINFLEXD_LINSR_WUF            BIT(5)                               /*!< wakeup flag */
#define LINFLEXD_LINSR_RDI            BIT(6)                               /*!< receiver data input */
#define LINFLEXD_LINSR_RXBUSY         BIT(7)                               /*!< receiver busy flag */
#define LINFLEXD_LINSR_DRBNE          BIT(8)                               /*!< data reception buffer not empty flag */
#define LINFLEXD_LINSR_RMB            BIT(9)                               /*!< release message buffer */
#define LINFLEXD_LINSR_LINS           BITS(12, 15)                         /*!< LIN state */
#define LINFLEXD_LINSR_RDC            BITS(16, 18)                         /*!< receive data byte count */
#define LINFLEXD_LINSR_AUTOSYNC_COMP  BIT(19)                              /*!< autosynchronization complete */

/* LINFLEXD_LINESR */
#define LINFLEXD_LINESR_NF            BIT(0)                               /*!< noise flag */
#define LINFLEXD_LINESR_BOF           BIT(7)                               /*!< buffer overrun flag */
#define LINFLEXD_LINESR_FEF           BIT(8)                               /*!< framing error flag */
#define LINFLEXD_LINESR_IDPEF         BIT(9)                               /*!< ID parity error flag */
#define LINFLEXD_LINESR_SDEF          BIT(10)                              /*!< break delimiter error flag */
#define LINFLEXD_LINESR_SFEF          BIT(11)                              /*!< sync field error flag */
#define LINFLEXD_LINESR_CEF           BIT(12)                              /*!< checksum error flag */
#define LINFLEXD_LINESR_BEF           BIT(13)                              /*!< bit error flag */
#define LINFLEXD_LINESR_OCF           BIT(14)                              /*!< output compare flag */
#define LINFLEXD_LINESR_SZF           BIT(15)                              /*!< stuck at zero flag */

/* LINFLEXD_LINTCSR */
#define LINFLEXD_LINTCSR_MODE             BIT(10)            /*!< timeout counter mode */
#define LINFLEXD_LINTCSR_IOT              BIT(9)             /*!< idle on timeout */
#define LINFLEXD_LINTCSR_TOCE             BIT(8)             /*!< timeout counter enable */
#define LINFLEXD_LINTCSR_CNT              BITS(0,7)          /*!< counter value */

/* LINFLEXD_LINOCR */
#define LINFLEXD_LINOCR_OC2               BITS(8,15)         /*!< output compare value 2 */
#define LINFLEXD_LINOCR_OC1               BITS(0,7)          /*!< output compare value 1 */

