sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.h
/* LINFLEXD_LINTOCR */
#define LINFLEXD_LINTOCR_RTO              BITS(8,11)         /*!< response timeout value */
#define LINFLEXD_LINTOCR_HTO              BITS(0,6)          /*!< header timeout value */

/* LINFLEXD_LINFBRR */
#define LINFLEXD_LINFBRR_FBR              BITS(0,3)          /*!< fractional baud rate */

/* LINFLEXD_LINIBRR */
#define LINFLEXD_LINIBRR_IBR              BITS(0,19)         /*!< integer baud rate */

/* LINFLEXD_LINCFR */
#define LINFLEXD_LINCFR_CF                BITS(0,7)          /*!< checksum bits */

/* LINFLEXD_LINCR2 */
#define LINFLEXD_LINCR2_TBDE              BIT(15)            /*!< two-bit delimiter enable */
#define LINFLEXD_LINCR2_IOBE              BIT(14)            /*!< idle on bit error */
#define LINFLEXD_LINCR2_IOPE              BIT(13)            /*!< idle on identifier parity error */
#define LINFLEXD_LINCR2_WURQ              BIT(12)            /*!< wakeup generate request */
#define LINFLEXD_LINCR2_DDRQ              BIT(11)            /*!< data discard request */
#define LINFLEXD_LINCR2_DTRQ              BIT(10)            /*!< data transmission request */
#define LINFLEXD_LINCR2_ABRQ              BIT(9)             /*!< abort request */
#define LINFLEXD_LINCR2_HTRQ              BIT(8)             /*!< header transmission request */

/* LINFLEXD_BIDR */
#define LINFLEXD_BIDR_DFL                 BITS(10,12)        /*!< data field length */
#define LINFLEXD_BIDR_DIR                 BIT(9)             /*!< direction */
#define LINFLEXD_BIDR_CCS                 BIT(8)             /*!< classic checksum */
#define LINFLEXD_BIDR_ID                  BITS(0,5)          /*!< identifier part */

/* LINFLEXD_BDRL */
#define LINFLEXD_BDRL_DATA3               BITS(24,31)        /*!< data byte 3 */
#define LINFLEXD_BDRL_DATA2               BITS(16,23)        /*!< data byte 2 */
#define LINFLEXD_BDRL_DATA1               BITS(8,15)         /*!< data byte 1 */
#define LINFLEXD_BDRL_DATA0               BITS(0,7)          /*!< data byte 0 */

/* LINFLEXD_BDRM */
#define LINFLEXD_BDRM_DATA7               BITS(24,31)        /*!< data byte 7 */
#define LINFLEXD_BDRM_DATA6               BITS(16,23)        /*!< data byte 6 */
#define LINFLEXD_BDRM_DATA5               BITS(8,15)         /*!< data byte 5 */
#define LINFLEXD_BDRM_DATA4               BITS(0,7)          /*!< data byte 4 */

/* LINFLEXD_IFER */
#define LINFLEXD_IFER_FACT15              BIT(15)            /*!< filter active 15 */
#define LINFLEXD_IFER_FACT14              BIT(14)            /*!< filter active 14 */
#define LINFLEXD_IFER_FACT13              BIT(13)            /*!< filter active 13 */
#define LINFLEXD_IFER_FACT12              BIT(12)            /*!< filter active 12 */
#define LINFLEXD_IFER_FACT11              BIT(11)            /*!< filter active 11 */
#define LINFLEXD_IFER_FACT10              BIT(10)            /*!< filter active 10 */
#define LINFLEXD_IFER_FACT9               BIT(9)             /*!< filter active 9 */
#define LINFLEXD_IFER_FACT8               BIT(8)             /*!< filter active 8 */
#define LINFLEXD_IFER_FACT7               BIT(7)             /*!< filter active 7 */
#define LINFLEXD_IFER_FACT6               BIT(6)             /*!< filter active 6 */
#define LINFLEXD_IFER_FACT5               BIT(5)             /*!< filter active 5 */
#define LINFLEXD_IFER_FACT4               BIT(4)             /*!< filter active 4 */
#define LINFLEXD_IFER_FACT3               BIT(3)             /*!< filter active 3 */
#define LINFLEXD_IFER_FACT2               BIT(2)             /*!< filter active 2 */
#define LINFLEXD_IFER_FACT1               BIT(1)             /*!< filter active 1 */
#define LINFLEXD_IFER_FACT0               BIT(0)             /*!< filter active 0 */

/* LINFLEXD_IFMI */
#define LINFLEXD_IFMI_IFMI                BITS(0,4)          /*!< filter match index */

/* LINFLEXD_IFMR */
#define LINFLEXD_IFMR_IFM7                BIT(7)             /*!< filter mode 7 */
#define LINFLEXD_IFMR_IFM6                BIT(6)             /*!< filter mode 6 */
#define LINFLEXD_IFMR_IFM5                BIT(5)             /*!< filter mode 5 */
#define LINFLEXD_IFMR_IFM4                BIT(4)             /*!< filter mode 4 */
#define LINFLEXD_IFMR_IFM3                BIT(3)             /*!< filter mode 3 */
#define LINFLEXD_IFMR_IFM2                BIT(2)             /*!< filter mode 2 */
#define LINFLEXD_IFMR_IFM1                BIT(1)             /*!< filter mode 1 */
#define LINFLEXD_IFMR_IFM0                BIT(0)             /*!< filter mode 0 */

/* LINFLEXD_IFCR */
#define LINFLEXD_IFCR_DFL                 BITS(10,12)        /*!< data field length */
#define LINFLEXD_IFCR_DIR                 BIT(9)             /*!< direction */
#define LINFLEXD_IFCR_CSS                 BIT(8)             /*!< classic checksum */
#define LINFLEXD_IFCR_ID                  BITS(0,5)          /*!< identifier */

/* LINFLEXD_GCR */
#define LINFLEXD_GCR_TDFBM                BIT(5)             /*!< transmit data first bit MSB */
#define LINFLEXD_GCR_RDFBM                BIT(4)             /*!< receive data first bit MSB */
#define LINFLEXD_GCR_TDLIS                BIT(3)             /*!< transmit data level inversion selection */
#define LINFLEXD_GCR_RDLIS                BIT(2)             /*!< received data level inversion selection */
#define LINFLEXD_GCR_STOP                 BIT(1)             /*!< one or two stop bit configuration */
#define LINFLEXD_GCR_SR                   BIT(0)             /*!< soft reset */

/* LINFLEXD_DMATXE */
#define LINFLEXD_DMATXE_DTE15             BIT(15)            /*!< DMA Tx channel 15 enable */
#define LINFLEXD_DMATXE_DTE14             BIT(14)            /*!< DMA Tx channel 14 enable */
#define LINFLEXD_DMATXE_DTE13             BIT(13)            /*!< DMA Tx channel 13 enable */
#define LINFLEXD_DMATXE_DTE12             BIT(12)            /*!< DMA Tx channel 12 enable */
#define LINFLEXD_DMATXE_DTE11             BIT(11)            /*!< DMA Tx channel 11 enable */
#define LINFLEXD_DMATXE_DTE10             BIT(10)            /*!< DMA Tx channel 10 enable */
#define LINFLEXD_DMATXE_DTE9              BIT(9)             /*!< DMA Tx channel 9 enable */
#define LINFLEXD_DMATXE_DTE8              BIT(8)             /*!< DMA Tx channel 8 enable */
#define LINFLEXD_DMATXE_DTE7              BIT(7)             /*!< DMA Tx channel 7 enable */
#define LINFLEXD_DMATXE_DTE6              BIT(6)             /*!< DMA Tx channel 6 enable */
#define LINFLEXD_DMATXE_DTE5              BIT(5)             /*!< DMA Tx channel 5 enable */
#define LINFLEXD_DMATXE_DTE4              BIT(4)             /*!< DMA Tx channel 4 enable */
#define LINFLEXD_DMATXE_DTE3              BIT(3)             /*!< DMA Tx channel 3 enable */
#define LINFLEXD_DMATXE_DTE2              BIT(2)             /*!< DMA Tx channel 2 enable */
#define LINFLEXD_DMATXE_DTE1              BIT(1)             /*!< DMA Tx channel 1 enable */
#define LINFLEXD_DMATXE_DTE0              BIT(0)             /*!< DMA Tx channel 0 enable */

/* LINFLEXD_DMARXE */
#define LINFLEXD_DMARXE_DRE15             BIT(15)            /*!< DMA Rx channel 15 enable */
#define LINFLEXD_DMARXE_DRE14             BIT(14)            /*!< DMA Rx channel 14 enable */
#define LINFLEXD_DMARXE_DRE13             BIT(13)            /*!< DMA Rx channel 13 enable */
#define LINFLEXD_DMARXE_DRE12             BIT(12)            /*!< DMA Rx channel 12 enable */
#define LINFLEXD_DMARXE_DRE11             BIT(11)            /*!< DMA Rx channel 11 enable */
#define LINFLEXD_DMARXE_DRE10             BIT(10)            /*!< DMA Rx channel 10 enable */
#define LINFLEXD_DMARXE_DRE9              BIT(9)             /*!< DMA Rx channel 9 enable */
#define LINFLEXD_DMARXE_DRE8              BIT(8)             /*!< DMA Rx channel 8 enable */
#define LINFLEXD_DMARXE_DRE7              BIT(7)             /*!< DMA Rx channel 7 enable */
#define LINFLEXD_DMARXE_DRE6              BIT(6)             /*!< DMA Rx channel 6 enable */
#define LINFLEXD_DMARXE_DRE5              BIT(5)             /*!< DMA Rx channel 5 enable */
#define LINFLEXD_DMARXE_DRE4              BIT(4)             /*!< DMA Rx channel 4 enable */
#define LINFLEXD_DMARXE_DRE3              BIT(3)             /*!< DMA Rx channel 3 enable */
#define LINFLEXD_DMARXE_DRE2              BIT(2)             /*!< DMA Rx channel 2 enable */
#define LINFLEXD_DMARXE_DRE1              BIT(1)             /*!< DMA Rx channel 1 enable */
#define LINFLEXD_DMARXE_DRE0              BIT(0)             /*!< DMA Rx channel 0 enable */

/* LINFLEXD_LIN_STCTL */
#define LINFLEXD_LIN_STCTL_RX_INV         BIT(5)             /*!< RX pin level inversion */
#define LINFLEXD_LIN_STCTL_TX_INV         BIT(4)             /*!< TX pin level inversion */
#define LINFLEXD_LIN_STCTL_SIZE           BITS(2,3)          /*!< the byte size transmitted on the IPS bus */
#define LINFLEXD_LIN_STCTL_ACK            BIT(1)             /*!< the stop function takes effect */
#define LINFLEXD_LIN_STCTL_STOP           BIT(0)             /*!< terminate the transmission */

/* constants definitions */
/* define the LINFLEXD bit position and its register index offset */
#define LINFLEXD_REGIDX_BIT(regidx, bitpos)    (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define LINFLEXD_REG_VAL(linflexdx, offset)    (REG32((linflexdx) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define LINFLEXD_BIT_POS(val)                  ((uint32_t)((uint32_t)(val) & 0x1FU))
#define LINFLEXD_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                              | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define LINFLEXD_REG_VAL2(linflexdx, offset)   (REG32((linflexdx) + ((uint32_t)(offset) >> 22)))
#define LINFLEXD_BIT_POS2(val)                 (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define LINFLEXD_LINCR1_REG_OFFSET             0x00000000U                 /*!< LINCR1 register offset */
#define LINFLEXD_LINIER_REG_OFFSET             0x00000004U                 /*!< LINIER register offset */
#define LINFLEXD_LINSR_REG_OFFSET              0x00000008U                 /*!< LINSR register offset */
#define LINFLEXD_LINESR_REG_OFFSET             0x0000000CU                 /*!< LINESR register offset */
#define LINFLEXD_DMATXE_REG_OFFSET             0x00000098U                 /*!< DMATXE register offset */
#define LINFLEXD_DMARXE_REG_OFFSET             0x0000009CU                 /*!< DMArXE register offset */

/* master break length */
#define LINFLEXD_BREAK_LENGTH_10_BIT           ((uint32_t)0x00000000U)     /*!< 10-bit break length */
#define LINFLEXD_BREAK_LENGTH_11_BIT           ((uint32_t)0x00000100U)     /*!< 11-bit break length */
#define LINFLEXD_BREAK_LENGTH_12_BIT           ((uint32_t)0x00000200U)     /*!< 12-bit break length */
#define LINFLEXD_BREAK_LENGTH_13_BIT           ((uint32_t)0x00000300U)     /*!< 13-bit break length */
#define LINFLEXD_BREAK_LENGTH_14_BIT           ((uint32_t)0x00000400U)     /*!< 14-bit break length */
#define LINFLEXD_BREAK_LENGTH_15_BIT           ((uint32_t)0x00000500U)     /*!< 15-bit break length */
#define LINFLEXD_BREAK_LENGTH_16_BIT           ((uint32_t)0x00000600U)     /*!< 16-bit break length */
#define LINFLEXD_BREAK_LENGTH_17_BIT           ((uint32_t)0x00000700U)     /*!< 17-bit break length */
#define LINFLEXD_BREAK_LENGTH_18_BIT           ((uint32_t)0x00000800U)     /*!< 18-bit break length */
#define LINFLEXD_BREAK_LENGTH_19_BIT           ((uint32_t)0x00000900U)     /*!< 19-bit break length */
#define LINFLEXD_BREAK_LENGTH_20_BIT           ((uint32_t)0x00000A00U)     /*!< 20-bit break length */
#define LINFLEXD_BREAK_LENGTH_21_BIT           ((uint32_t)0x00000B00U)     /*!< 21-bit break length */
#define LINFLEXD_BREAK_LENGTH_22_BIT           ((uint32_t)0x00000C00U)     /*!< 22-bit break length */
#define LINFLEXD_BREAK_LENGTH_23_BIT           ((uint32_t)0x00000D00U)     /*!< 23-bit break length */
#define LINFLEXD_BREAK_LENGTH_36_BIT           ((uint32_t)0x00000E00U)     /*!< 36-bit break length */
#define LINFLEXD_BREAK_LENGTH_50_BIT           ((uint32_t)0x00000F00U)     /*!< 50-bit break length */

/* slave mode sync break length */
#define LINFLEXD_SLAVE_BREAK_11_BIT             ((uint32_t)0x00000000U)    /*!< 11-bit break length */
#define LINFLEXD_SLAVE_BREAK_10_BIT             LINFLEXD_LINCR1_SSBL       /*!< 10-bit break length */

