sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.h
/* receiver buffer locked mode */
#define LINFLEXD_RECEIVER_BUFFER_NORMAL       ((uint32_t)0x00000000U)      /*!< normal receiver buffer mode */
#define LINFLEXD_RECEIVER_BUFFER_LOCKED       LINFLEXD_LINCR1_RBLM         /*!< receiver buffer locked mode */

/* bypass filter */
#define BYPASS_LINFLEXD_FILTER_DISABLE          ((uint32_t)0x00000000U)    /*!< bypass filter disable */
#define BYPASS_LINFLEXD_FILTER_ENABLE           LINFLEXD_LINCR1_BF         /*!< bypass filter enable */
                                                                          
/* automatic wake up */                                                   
#define LINFLEXD_WAKEUP_SOFTWARE_CLEAR          ((uint32_t)0x00000000U)    /*!< software wake-up */
#define LINFLEXD_WAKEUP_HARDWARE_CLEAR          LINFLEXD_LINCR1_AUTOWU     /*!< automatic wake-up */
                                                                          
/* LIN autosynchronization enable */                                      
#define LINFLEXD_AUTOSYNC_DISABLE               ((uint32_t)0x00000000U)    /*!< auto synchronization disable */
#define LINFLEXD_AUTOSYNC_ENABLE                LINFLEXD_LINCR1_LASE       /*!< auto synchronization enable */
                                                                          
/* checksum field disable */                                              
#define LINFLEXD_CHECKSUM_FIELD_ENABLE          ((uint32_t)0x00000000U)    /*!< checksum field enable */
#define LINFLEXD_CHECKSUM_FIELD_DISABLE         LINFLEXD_LINCR1_CFD        /*!< checksum field disable */
                                                                          
/* checksum calculation disable */                                        
#define LINFLEXD_CHECKSUM_CALC_ENABLE           ((uint32_t)0x00000000U)    /*!< checksum calculation enable */
#define LINFLEXD_CHECKSUM_CALC_DISABLE          LINFLEXD_LINCR1_CCD        /*!< checksum calculation disable */
                                                                          
/* LIN state capture enable on bit error */                               
#define LINFLEXD_STATE_CAPTURE_DISABLE          ((uint32_t)0x00000000U)    /*!< LIN state capture disable */
#define LINFLEXD_STATE_CAPTURE_ENABLE           LINFLEXD_LINCR1_NLSE       /*!< LIN state capture enable */

/* LIN mode state */
#define LINFLEXD_LIN_STATE(regval)             (BITS(12, 15) & ((uint32_t)(regval) << 12U))
#define LINFLEXD_LIN_STATE_IDLE                LINFLEXD_LIN_STATE(0)       /*!< idle state */
#define LINFLEXD_LIN_STATE_SYNC_BREAK          LINFLEXD_LIN_STATE(1)       /*!< sync break state */
#define LINFLEXD_LIN_STATE_SYNC_DEL            LINFLEXD_LIN_STATE(2)       /*!< sync del state */
#define LINFLEXD_LIN_STATE_SYNC                LINFLEXD_LIN_STATE(3)       /*!< sync state */
#define LINFLEXD_LIN_STATE_ID                  LINFLEXD_LIN_STATE(4)       /*!< ID state */
#define LINFLEXD_LIN_STATE_HEADER_RX           LINFLEXD_LIN_STATE(5)       /*!< header rx state */
#define LINFLEXD_LIN_STATE_HEADER_TX           LINFLEXD_LIN_STATE(6)       /*!< header tx state */
#define LINFLEXD_LIN_STATE_DATA_RX             LINFLEXD_LIN_STATE(7)       /*!< data rx state */
#define LINFLEXD_LIN_STATE_DATA_TX             LINFLEXD_LIN_STATE(8)       /*!< data tx state */
#define LINFLEXD_LIN_STATE_CHECKSUM            LINFLEXD_LIN_STATE(9)       /*!< checksum state */

/* LINFLEXD flags */
typedef enum {
    /* flags in LINSR */
    LINFLEXD_FLAG_HRF             = LINFLEXD_REGIDX_BIT(LINFLEXD_LINSR_REG_OFFSET, 0U),      /*!< header received flag */
    LINFLEXD_FLAG_DTF             = LINFLEXD_REGIDX_BIT(LINFLEXD_LINSR_REG_OFFSET, 1U),      /*!< data transmission completed flag */
    LINFLEXD_FLAG_DRF             = LINFLEXD_REGIDX_BIT(LINFLEXD_LINSR_REG_OFFSET, 2U),      /*!< data reception completed flag */
    LINFLEXD_FLAG_WUF             = LINFLEXD_REGIDX_BIT(LINFLEXD_LINSR_REG_OFFSET, 5U),      /*!< wakeup flag */
    LINFLEXD_FLAG_RXBUSY          = LINFLEXD_REGIDX_BIT(LINFLEXD_LINSR_REG_OFFSET, 7U),      /*!< receiver busy flag */
    LINFLEXD_FLAG_DRBNE           = LINFLEXD_REGIDX_BIT(LINFLEXD_LINSR_REG_OFFSET, 8U),      /*!< data reception buffer not empty flag */
    LINFLEXD_FLAG_RMB             = LINFLEXD_REGIDX_BIT(LINFLEXD_LINSR_REG_OFFSET, 9U),      /*!< release message buffer */
    LINFLEXD_FLAG_AUTOSYNC_COMP   = LINFLEXD_REGIDX_BIT(LINFLEXD_LINSR_REG_OFFSET, 19U),     /*!< autosynchronization complete */
    /* flags in LINESR */
    LINFLEXD_FLAG_NF              = LINFLEXD_REGIDX_BIT(LINFLEXD_LINESR_REG_OFFSET, 0U),     /*!< noise flag */
    LINFLEXD_FLAG_BOF             = LINFLEXD_REGIDX_BIT(LINFLEXD_LINESR_REG_OFFSET, 7U),     /*!< buffer overrun flag */
    LINFLEXD_FLAG_FEF             = LINFLEXD_REGIDX_BIT(LINFLEXD_LINESR_REG_OFFSET, 8U),     /*!< framing error flag */
    LINFLEXD_FLAG_IDPEF           = LINFLEXD_REGIDX_BIT(LINFLEXD_LINESR_REG_OFFSET, 9U),     /*!< ID parity error flag */
    LINFLEXD_FLAG_SDEF            = LINFLEXD_REGIDX_BIT(LINFLEXD_LINESR_REG_OFFSET, 10U),    /*!< break delimiter error flag */
    LINFLEXD_FLAG_SFEF            = LINFLEXD_REGIDX_BIT(LINFLEXD_LINESR_REG_OFFSET, 11U),    /*!< sync field error flag */
    LINFLEXD_FLAG_CEF             = LINFLEXD_REGIDX_BIT(LINFLEXD_LINESR_REG_OFFSET, 12U),    /*!< checksum error flag */
    LINFLEXD_FLAG_BEF             = LINFLEXD_REGIDX_BIT(LINFLEXD_LINESR_REG_OFFSET, 13U),    /*!< bit error flag */
    LINFLEXD_FLAG_OCF             = LINFLEXD_REGIDX_BIT(LINFLEXD_LINESR_REG_OFFSET, 14U),    /*!< output compare flag */
    LINFLEXD_FLAG_SZF             = LINFLEXD_REGIDX_BIT(LINFLEXD_LINESR_REG_OFFSET, 15U),    /*!< stuck at zero flag */
} linflexd_flag_enum;

/* LINFLEXD interrupt flags */
typedef enum {
    /* interrupt flags in LINSR and LINIER */
    LINFLEXD_INT_FLAG_HRF            = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINSR_REG_OFFSET, 0U, LINFLEXD_LINIER_REG_OFFSET, 0U),   /*!< header received interrupt and flag */
    LINFLEXD_INT_FLAG_DTF            = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINSR_REG_OFFSET, 1U, LINFLEXD_LINIER_REG_OFFSET, 1U),   /*!< data transmission completed interrupt and flag */
    LINFLEXD_INT_FLAG_DRF            = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINSR_REG_OFFSET, 2U, LINFLEXD_LINIER_REG_OFFSET, 2U),   /*!< data reception completed interrupt and flag */
    LINFLEXD_INT_FLAG_WUF            = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINSR_REG_OFFSET, 5U, LINFLEXD_LINIER_REG_OFFSET, 5U),   /*!< wakeup interrupt and flag */
    /* interrupt flags in LINESR and LINIER */
    LINFLEXD_INT_FLAG_BOF            = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINESR_REG_OFFSET, 7U,  LINFLEXD_LINIER_REG_OFFSET, 7U),  /*!< buffer overrun interrupt and flag */
    LINFLEXD_INT_FLAG_FEF            = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINESR_REG_OFFSET, 8U,  LINFLEXD_LINIER_REG_OFFSET, 8U),  /*!< framing error interrupt and flag */
    LINFLEXD_INT_FLAG_IDPEF          = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINESR_REG_OFFSET, 9U,  LINFLEXD_LINIER_REG_OFFSET, 11U), /*!< ID parity error interrupt and flag */
    LINFLEXD_INT_FLAG_SDEF           = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINESR_REG_OFFSET, 10U, LINFLEXD_LINIER_REG_OFFSET, 11U), /*!< Sync Break delimiter error interrupt and flag */
    LINFLEXD_INT_FLAG_SFEF           = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINESR_REG_OFFSET, 11U, LINFLEXD_LINIER_REG_OFFSET, 11U), /*!< Sync field error interrupt and flag */
    LINFLEXD_INT_FLAG_CEF            = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINESR_REG_OFFSET, 12U, LINFLEXD_LINIER_REG_OFFSET, 12U), /*!< checksum error interrupt and flag */
    LINFLEXD_INT_FLAG_BEF            = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINESR_REG_OFFSET, 13U, LINFLEXD_LINIER_REG_OFFSET, 13U), /*!< bit error interrupt and flag */
    LINFLEXD_INT_FLAG_OCF            = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINESR_REG_OFFSET, 14U, LINFLEXD_LINIER_REG_OFFSET, 14U), /*!< output compare interrupt and flag */
    LINFLEXD_INT_FLAG_SZF            = LINFLEXD_REGIDX_BIT2(LINFLEXD_LINESR_REG_OFFSET, 15U, LINFLEXD_LINIER_REG_OFFSET, 15U), /*!< stuck at zero interrupt and flag */
} linflexd_interrupt_flag_enum;

/* LINFLEXD interrupts */
typedef enum {
    /* interrupts in LINIER */
    LINFLEXD_INT_HRIE               = LINFLEXD_LINIER_HRIE,   /*!< header received interrupt */
    LINFLEXD_INT_DTIE               = LINFLEXD_LINIER_DTIE,   /*!< data transmitted interrupt */
    LINFLEXD_INT_DRIE               = LINFLEXD_LINIER_DRIE,   /*!< data reception complete interrupt */
    LINFLEXD_INT_TOIE               = LINFLEXD_LINIER_TOIE,   /*!< timeout interrupt */
    LINFLEXD_INT_WUIE               = LINFLEXD_LINIER_WUIE,   /*!< wakeup interrupt */
    LINFLEXD_INT_LSIE               = LINFLEXD_LINIER_LSIE,   /*!< LIN state interrupt */
    LINFLEXD_INT_BOIE               = LINFLEXD_LINIER_BOIE,   /*!< buffer overrun interrupt */
    LINFLEXD_INT_FEIE               = LINFLEXD_LINIER_FEIE,   /*!< frame error interrupt */
    LINFLEXD_INT_HEIE               = LINFLEXD_LINIER_HEIE,  /*!< header error interrupt */
    LINFLEXD_INT_CEIE               = LINFLEXD_LINIER_CEIE,  /*!< checksum error interrupt */
    LINFLEXD_INT_BEIE               = LINFLEXD_LINIER_BEIE,  /*!< bit error interrupt */
    LINFLEXD_INT_OCIE               = LINFLEXD_LINIER_OCIE,  /*!< output compare interrupt */
    LINFLEXD_INT_SZIE               = LINFLEXD_LINIER_SZIE,  /*!< stuck at zero interrupt */
} linflexd_interrupt_enum;

/* LINFLEXD dma tx channel */
typedef enum {
    /* interrupts in LINIER */
    LINFLEXD_DMATX_CHANNEL0            = LINFLEXD_DMATXE_DTE0,   /*!< header received interrupt */
    LINFLEXD_DMATX_CHANNEL1            = LINFLEXD_DMATXE_DTE1,   /*!< data transmitted interrupt */
    LINFLEXD_DMATX_CHANNEL2            = LINFLEXD_DMATXE_DTE2,   /*!< data reception complete interrupt */
    LINFLEXD_DMATX_CHANNEL3            = LINFLEXD_DMATXE_DTE3,   /*!< timeout interrupt */
    LINFLEXD_DMATX_CHANNEL4            = LINFLEXD_DMATXE_DTE4,   /*!< wakeup interrupt */
    LINFLEXD_DMATX_CHANNEL5            = LINFLEXD_DMATXE_DTE5,   /*!< LIN state interrupt */
    LINFLEXD_DMATX_CHANNEL6            = LINFLEXD_DMATXE_DTE6,   /*!< buffer overrun interrupt */
    LINFLEXD_DMATX_CHANNEL7            = LINFLEXD_DMATXE_DTE7,   /*!< frame error interrupt */
    LINFLEXD_DMATX_CHANNEL8            = LINFLEXD_DMATXE_DTE8,  /*!< header error interrupt */
    LINFLEXD_DMATX_CHANNEL9            = LINFLEXD_DMATXE_DTE9,  /*!< checksum error interrupt */
    LINFLEXD_DMATX_CHANNEL10           = LINFLEXD_DMATXE_DTE10,  /*!< bit error interrupt */
    LINFLEXD_DMATX_CHANNEL11           = LINFLEXD_DMATXE_DTE11,  /*!< output compare interrupt */
    LINFLEXD_DMATX_CHANNEL12           = LINFLEXD_DMATXE_DTE12,  /*!< stuck at zero interrupt */
    LINFLEXD_DMATX_CHANNEL13           = LINFLEXD_DMATXE_DTE13,  /*!< bit error interrupt */
    LINFLEXD_DMATX_CHANNEL14           = LINFLEXD_DMATXE_DTE14,  /*!< output compare interrupt */
    LINFLEXD_DMATX_CHANNEL15           = LINFLEXD_DMATXE_DTE15,  /*!< stuck at zero interrupt */
} linflexd_dma_tx_channel_enum;

/* LINFLEXD dma rx channel */
typedef enum {
    /* interrupts in LINIER */
    LINFLEXD_DMARX_CHANNEL0            = LINFLEXD_DMARXE_DRE0,   /*!< header received interrupt */
    LINFLEXD_DMARX_CHANNEL1            = LINFLEXD_DMARXE_DRE1,   /*!< data transmitted interrupt */
    LINFLEXD_DMARX_CHANNEL2            = LINFLEXD_DMARXE_DRE2,   /*!< data reception complete interrupt */
    LINFLEXD_DMARX_CHANNEL3            = LINFLEXD_DMARXE_DRE3,   /*!< timeout interrupt */
    LINFLEXD_DMARX_CHANNEL4            = LINFLEXD_DMARXE_DRE4,   /*!< wakeup interrupt */
    LINFLEXD_DMARX_CHANNEL5            = LINFLEXD_DMARXE_DRE5,   /*!< LIN state interrupt */
    LINFLEXD_DMARX_CHANNEL6            = LINFLEXD_DMARXE_DRE6,   /*!< buffer overrun interrupt */
    LINFLEXD_DMARX_CHANNEL7            = LINFLEXD_DMARXE_DRE7,   /*!< frame error interrupt */
    LINFLEXD_DMARX_CHANNEL8            = LINFLEXD_DMARXE_DRE8,  /*!< header error interrupt */
    LINFLEXD_DMARX_CHANNEL9            = LINFLEXD_DMARXE_DRE9,  /*!< checksum error interrupt */
    LINFLEXD_DMARX_CHANNEL10           = LINFLEXD_DMARXE_DRE10,  /*!< bit error interrupt */
    LINFLEXD_DMARX_CHANNEL11           = LINFLEXD_DMARXE_DRE11,  /*!< output compare interrupt */
    LINFLEXD_DMARX_CHANNEL12           = LINFLEXD_DMARXE_DRE12,  /*!< stuck at zero interrupt */
    LINFLEXD_DMARX_CHANNEL13           = LINFLEXD_DMARXE_DRE13,  /*!< bit error interrupt */
    LINFLEXD_DMARX_CHANNEL14           = LINFLEXD_DMARXE_DRE14,  /*!< output compare interrupt */
    LINFLEXD_DMARX_CHANNEL15           = LINFLEXD_DMARXE_DRE15,  /*!< stuck at zero interrupt */
} linflexd_dma_rx_channel_enum;

/* LINFLEXD node enum */
typedef enum
{
    LINFlexD_SLAVE = 0U,        /*!< Node acts as a slave in LINFlexD mode */
    LINFlexD_MASTER = 1U,       /*!< Node acts as a master in LINFlexD mode */
} linflexd_lin_node_enum;

