sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.h
typedef enum
{
    LIN_ENHANCED_CHECKSUM = 0,    /*!< LINFlexD enhanced checksum method */
    LIN_CLASSIC_CHECKSUM = 1      /*!< LINFlexD classical checksum method */
} linflexd_lin_checksum_enum;

typedef enum
{
    LIN_MASTER_RESPONSE = 0,    /*!< LIN master send response, slave receive */
    LIN_SLAVE_RESPONSE = 1,    /*!< LIN slave send response, master receive */
    LIN_SLAVE_TO_SLAVE = 2     /*!< LIN slave send response, slave receive
                                        Master only send out header */
} linflexd_lin_response_enum;

typedef enum
{
    LINFlexD_RX = 0U,        /*!< Receive frames in LIN */
    LINFlexD_TX = 1U         /*!< Transmit frames in LIN */
} linflexd_lin_direction_enum;

typedef enum
{
    LINFlexD_DMA_RX = 0U,        /*!< Receive frames in LIN */
    LINFlexD_DMA_TX = 1U         /*!< Transmit frames in LIN */
} linflexd_lin_dma_direction_enum;

typedef enum
{
    LINFlexD_BREAK_10_BIT = 0x00U,                      /*!< LIN break 10 bits */
    LINFlexD_BREAK_11_BIT = 0x01U,                      /*!< LIN break 11 bits */
    LINFlexD_BREAK_12_BIT = 0x02U,                      /*!< LIN break 12 bits */
    LINFlexD_BREAK_13_BIT = 0x03U,                      /*!< LIN break 13 bits */
    LINFlexD_BREAK_14_BIT = 0x04U,                      /*!< LIN break 14 bits */
    LINFlexD_BREAK_15_BIT = 0x05U,                      /*!< LIN break 15 bits */
    LINFlexD_BREAK_16_BIT = 0x06U,                      /*!< LIN break 16 bits */
    LINFlexD_BREAK_17_BIT = 0x07U,                      /*!< LIN break 17 bits */
    LINFlexD_BREAK_18_BIT = 0x08U,                      /*!< LIN break 18 bits */
    LINFlexD_BREAK_19_BIT = 0x09U,                      /*!< LIN break 19 bits */
    LINFlexD_BREAK_20_BIT = 0x10U,                      /*!< LIN break 20 bits */
    LINFlexD_BREAK_21_BIT = 0x11U,                      /*!< LIN break 21 bits */
    LINFlexD_BREAK_22_BIT = 0x12U,                      /*!< LIN break 22 bits */
    LINFlexD_BREAK_23_BIT = 0x13U,                      /*!< LIN break 23 bits */
    LINFlexD_BREAK_36_BIT = 0x14U,                      /*!< LIN break 36 bits */
    LINFlexD_BREAK_50_BIT = 0x15U,                      /*!< LIN break 50 bits */
} linflexd_lin_break_length_enum;

typedef enum
{
    LINFlexD_STATE_SLEEP_MODE = 0U,                     /*!< Sleep mode */
    LINFlexD_STATE_INIT_MODE = 1U,                      /*!< Initialization mode */
    LINFlexD_STATE_IDLE_MODE = 2U,                      /*!< Idle mode */
    LINFlexD_STATE_SYNC_BREAK = 3U,                     /*!< Sync break */
    LINFlexD_STATE_SYNC_DEL = 4U,                       /*!< Sync delimiter */
    LINFlexD_STATE_SYNC_FIELD = 5U,                     /*!< Sync field */
    LINFlexD_STATE_IDENTIFIER_FIELD = 6U,               /*!< Identifier field */
    LINFlexD_STATE_HEADER_RX_TX = 7U,                   /*!< Header transmit/receive */
    LINFlexD_STATE_DATA_RX_TX = 8U,                     /*!< Data transmit/receive */
    LINFlexD_STATE_CHECKSUM = 9U                        /*!< Check sum */
} linflexd_lin_hw_state_enum;

typedef enum
{
    /* Generic error codes */
    STATUS_SUCCESS                         = 0x000U,    /*!< Generic operation success status */
    STATUS_ERROR                           = 0x001U,    /*!< Generic operation failure status */
    STATUS_BUSY                            = 0x002U,    /*!< Generic operation busy status */
    STATUS_TIMEOUT                         = 0x003U,    /*!< Generic operation timeout status */
    STATUS_UNSUPPORTED                     = 0x004U,    /*!< Generic operation unsupported status */
    STATUS_NOCLOCK                         = 0x005U,    /*!< Generic operation noclock status */
    STATUS_InvalidArgument                 = 0x006U,    /*!< Generic operation invalid argument status */
    /* UART specific error codes */
    STATUS_UART_TX_UNDERRUN                = 0x600U,  /*!< TX underrun error */
    STATUS_UART_RX_OVERRUN                 = 0x601U,  /*!< RX overrun error */
    STATUS_UART_ABORTED                    = 0x602U,  /*!< A transfer was aborted */
    STATUS_UART_FRAMING_ERROR              = 0x603U,  /*!< Framing error */
    STATUS_UART_PARITY_ERROR               = 0x604U,  /*!< Parity error */
    STATUS_UART_NOISE_ERROR                = 0x605U,  /*!< Noise error */
    STATUS_UART_IDLE_ERROR                 = 0x606U,  /*!< Line idle error */
    /* LINFlexD specific error codes */
    STATUS_LINFlexD_NO_HEADER_RECEIVED     = 0x700U,  /*!< LINFlexD no header received */
    STATUS_LINFlexD_ABORT_TIMEOUT          = 0x701U,  /*!< LINFlexD abort transfer timeout error*/
} linflexd_lin_status_enum;

/* LINFLEXD id filter structure */
typedef struct
{
    FlagStatus filterEnable;                      /*!< Enable the id filters */
    uint8_t maskEnable;                           /*!< Mask enable for filter pairs */
    uint32_t dataFieldLength;                      /*!< LIN frame data length */
    linflexd_lin_direction_enum direction;        /*!< The direction of data field */
    linflexd_lin_checksum_enum checksumType;      /*!< LIN Checksum method */
    uint8_t id;                                   /*!< LIN ID */
    uint8_t data[8];                              /*!< LIN Data pointer */
} linflexd_lin_id_filter_struct;

/* structure definitions */
/* LINFLEXD parameter structure */
typedef struct {
    uint32_t baudRate;                              /*!< baudrate of LIN Hardware Interface to configure */
    linflexd_lin_node_enum ismaster;                /*!< Node function as Master or Slave */
    linflexd_lin_break_length_enum breakLength;     /*!< Break length, only for master mode */
    FlagStatus autobaudEnable;                      /*!< Enable Autobaud feature, only for slave mode */
    uint8_t responseTimeoutValue;                   /*!< Timeout value for response */
    uint8_t headerTimeoutValue;                     /*!< Timeout value for header */
    uint8_t filterCount;                            /*!< Actual filters used */
    linflexd_lin_id_filter_struct *slaveFilterCfgPtr; /*!< Slave filter configurations, only for slave mode */
    uint8_t *classicID;                             /*!< List of IDs use classic checksum */
    uint8_t numOfClassicID;                         /*!< Number of IDs use classic checksum */
    uint32_t linStatecaputure;                      /*!< LIN state capture disable or enable on bit error*/
    uint32_t checksumCalculaton;                    /*!< Checksum calculation disable or enable*/
    uint32_t checksumField;                         /*!< Checksum field disable or enable*/
    uint32_t automaticWakeUp;                       /*!< Automatic Wake-Up by software or hardware*/
    uint32_t bypassFilter;                          /*!< Bypass filter-controls the receive filter bypass function*/
    uint32_t slaveSyncLength;                       /*!< Slave mode sync break length-sets the number of bit times for break field detection*/
    uint32_t receiverBufferLock;                    /*!< Receiver buffer locked mode locked or not*/
} linflexd_lin_parameter_struct;

