sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check LINFLEXD_LIN peripherals */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) 
#define NOT_LINFLEXD_LIN_PERIPH(periph)     (((periph) != LINFLEXD_LIN0)  && ((periph) != LINFLEXD_LIN1)  && \
                                              ((periph) != LINFLEXD_LIN2)  && ((periph) != LINFLEXD_LIN3)  && \
                                              ((periph) != LINFLEXD_LIN4)  && ((periph) != LINFLEXD_LIN5)  && \
                                              ((periph) != LINFLEXD_LIN6)  && ((periph) != LINFLEXD_LIN7)  && \
                                              ((periph) != LINFLEXD_LIN8)  && ((periph) != LINFLEXD_LIN9)  && \
                                              ((periph) != LINFLEXD_LIN10) && ((periph) != LINFLEXD_LIN11))
#else
#define NOT_LINFLEXD_LIN_PERIPH(periph)     (((periph) != LINFLEXD_LIN0)  && ((periph) != LINFLEXD_LIN1)  && \
                                              ((periph) != LINFLEXD_LIN2)  && ((periph) != LINFLEXD_LIN3)  && \
                                              ((periph) != LINFLEXD_LIN4)  && ((periph) != LINFLEXD_LIN5))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* check if the baudrate is not a LINFlexD_UART baudrate */
#define NOT_LINFLEXD_LIN_BAUDRATE(baudval)                  ((baudval) == 0U)

/* check integer baud rate parameter */
#define NOT_LINFLEXD_LIN_IBR(ibr)                           ((ibr) > 0xFFFFFU)

/* check fractional baud rate parameter */
#define NOT_LINFLEXD_LIN_FBR(fbr)                           ((fbr) > 0xFU)

/* check LINFlexD_LIN transmit receive data length */
#define NOT_LINFLEXD_LIN_TR_DATALENGTH(size)                ((size) > 0xFU)

/* check LINFlexD_LIN SLEEP */
#define NOT_LINFLEXD_LIN_SLEEP_ENABLE(enable)               (((enable) != 0x0U) && ((enable) != 0x1U))

/* check LINFlexD_LIN BIDR ID*/
#define NOT_LINFLEXD_LIN_BIDR_ID(id)                        ((id) > 0x3FU)

/* check response timeout value parameter */
#define NOT_LINFLEXD_LIN_RESPONSE_TIMEOUT_VALUE(value)      ((value) > 0x0FU)

/* check header timeout value parameter */
#define NOT_LINFLEXD_LIN_HEADER_TIMEOUT_VALUE(value)        ((value) > 0x7FU)

/* check filter count parameter */
#define NOT_LINFLEXD_LIN_FILTER_COUNT(filtercount)          ((filtercount) > 0x0FU)

/* check stop bits parameter */
#define NOT_LINFLEXD_LIN_STOP_BIT(stopbits)                 (((stopbits) != 0x0U) && ((stopbits) != 0x1U))

/* check ips bus size parameter */
#define NOT_LINFLEXD_LIN_IPS_BUS_SIZE(size)                 ((size) > 0x3U)
/* check transmit data length parameter */
#define NOT_LINFLEXD_LIN_DATA_LENGTH_SIZE(size)             ((size) > 0x8U)
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* initialization functions */
/* reset LIN Peripheral */
ErrStatus linflexd_deinit(uint32_t linflexdx);
/* Initialize LIN peripheral parameter structure */
void linflexd_lin_struct_para_init(linflexd_lin_parameter_struct *initpara);
/* Initialize LIN peripheral */
ErrStatus linflexd_lin_init(uint32_t lin_periph, linflexd_lin_parameter_struct *initpara);

/* application function declarations */
/* Set the baud rate of the LIN module */
void linflexd_lin_baudrate_set(uint32_t lin_periph, uint32_t baudval);
/* set integer part of LIN baudrate register */
void linflexd_lin_set_integer_baudrate(uint32_t lin_periph, uint32_t ibr);
/* set fractional part of LIN baudrate register */
void linflexd_lin_set_fractional_baudrate(uint32_t lin_periph, uint8_t fbr);
/* LIN mode data transfer */
void linflexd_lin_data_transmit(uint32_t lin_periph, uint8_t *data, uint8_t size);
/* LIN mode data transfer */
void linflexd_lin_data_receive(uint32_t lin_periph, uint8_t *data, uint8_t size);
/* Get LIN checksum */
uint8_t linflexd_lin_get_checksum(uint32_t lin_periph);
/* LIN module enters initialization mode */
void linflexd_lin_enter_init_mode(uint32_t lin_periph);
/* LIN module enters normal operation mode */
void linflexd_lin_enter_normal_mode(uint32_t lin_periph);
/* Set LIN module to enter or exit sleep mode */
void linflexd_lin_set_sleep_mode(uint32_t lin_periph, uint8_t enable);
/* Get LIN module sleep mode */
FlagStatus linflexd_lin_get_sleep_mode(uint32_t lin_periph);
/* Enable LIN module auto synchronization */
void linflexd_lin_auto_sync_enable(uint32_t lin_periph);
/* Disable LIN module auto synchronization */
void linflexd_lin_auto_sync_disable(uint32_t lin_periph);
/* enable LIN module loopback mode */
void linflexd_lin_loopback_enable(uint32_t lin_periph);
/* disable LIN module loopback mode */
void linflexd_lin_loopback_disable(uint32_t lin_periph);
/* Configure LIN module transfer direction */
void linflexd_lin_set_direction(uint32_t lin_periph, linflexd_lin_direction_enum dir);
/* Configure LIN module transfer data length */
void linflexd_lin_set_data_length(uint32_t lin_periph, uint32_t size);
/* Configure LIN module identifier filter */
void linflexd_lin_set_bidr(uint32_t lin_periph, uint8_t id, uint32_t size, linflexd_lin_direction_enum dir, linflexd_lin_checksum_enum ccs);
/* Enable header transfer request */
void linflexd_lin_header_request_enable(uint32_t lin_periph);
/* Enable data transfer request */
void linflexd_lin_data_request_enable(uint32_t lin_periph);
/* Enable LIN module wakeup request */
void linflexd_lin_wakeup_request_enable(uint32_t lin_periph);
/* Config LINFlexD_LIN auto wakeup hardware to clear the SLEEP bit */
void linflexd_lin_autowake_hw_clear(uint32_t lin_periph);
/* Config LINFlexD_LIN auto wakeup software to clear the SLEEP bit */
void linflexd_lin_autowake_sw_clear(uint32_t lin_periph);
/* Enable LIN module data discard request */
void linflexd_lin_data_discard_enable(uint32_t lin_periph);
/* Enable idle on bit error for LIN module */
void linflexd_lin_idle_bit_error_enable(uint32_t lin_periph);
/* Disable idle on bit error for LIN module */
void linflexd_lin_idle_bit_error_disable(uint32_t lin_periph);
/* Enable idle on parity error for LIN module */
void linflexd_lin_idle_parity_error_enable(uint32_t lin_periph);
/* Disable idle on parity error for LIN module */
void linflexd_lin_idle_parity_error_disable(uint32_t lin_periph);
/* Enable LIN module transfer abort request */
void linflexd_lin_transfer_abort_enable(uint32_t lin_periph);
/* Get LIN transfer abort status */
uint8_t linflexd_lin_get_transfer_abort(uint32_t lin_periph);
/* Set ID in LIN BIDR register */
void linflexd_lin_set_bidr_id(uint32_t lin_periph, uint8_t id);
/* Get ID in LIN BIDR register */
uint8_t linflexd_lin_get_bidr_id(uint32_t lin_periph);
/* Enable LIN master mode */
void linflexd_lin_master_mode_enable(uint32_t lin_periph);
/* Disable LIN master mode */
void linflexd_lin_master_mode_disable(uint32_t lin_periph);
/* Get current working state of LIN */
linflexd_lin_hw_state_enum linflexd_lin_get_state(uint32_t lin_periph);

