sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.h
/* LIN timeout */
/* Enable timeout */
void linflexd_lin_timeout_enable(uint32_t lin_periph);
/* Disable timeout */
void linflexd_lin_timeout_disable(uint32_t lin_periph);
/* Set timeout value */
void linflexd_lin_set_timeout_value(uint32_t lin_periph, uint8_t responseTimeout, uint8_t headerTimeout);
/* Set oc value */
void linflexd_lin_set_oc_value(uint32_t lin_periph, uint8_t oc1, uint8_t oc2);

/* LIN identifier filter */
/* Configure LIN identifier filter */
void linflexd_lin_config_id_filter(uint32_t lin_periph, uint8_t filterCount, linflexd_lin_id_filter_struct *config);
/* Get identifier filter match index */
uint8_t linflexd_lin_get_filter_match_index(uint32_t lin_periph);

/* LIN transmit order */
/*  set byte order msb enable for LIN data transmission */
void linflexd_lin_tx_order_msb_enable(uint32_t lin_periph);
/*  set byte order msb disable for LIN data transmission */
void linflexd_lin_tx_order_msb_disable(uint32_t lin_periph);
/* set byte order msb enable for LIN data reception */
void linflexd_lin_rx_order_msb_enable(uint32_t lin_periph);
/* set byte order msb disable for LIN data reception */
void linflexd_lin_rx_order_msb_disable(uint32_t lin_periph);

/* LIN transmit stop and soft reset */
/* Configure number of stop bits for LIN */
void linflexd_lin_stop_bit_config(uint32_t lin_periph, uint8_t stopBits);
/* Perform software reset on LIN module enable */
void linflexd_lin_soft_reset_enable(uint32_t lin_periph);
/* Perform software reset on LIN module disable */
void linflexd_lin_soft_reset_disable(uint32_t lin_periph);
/* Enable LIN signal inversion function */
void linflexd_lin_inversion_enable(uint32_t lin_periph);
/* Disable LIN signal inversion function */
void linflexd_lin_inversion_disable(uint32_t lin_periph);
/* Two Bit delimiter enable for LIN module */
void linflexd_lin_two_bit_delimiter_enable(uint32_t lin_periph);
/* Two Bit delimiter disnable for LIN module */
void linflexd_lin_two_bit_delimiter_disable(uint32_t lin_periph);
/* Set LIN module to enter STOP request */
void linflexd_lin_stop_request_set(uint32_t lin_periph);
/* Get LIN module STOP request acknowledge status */
uint8_t linflexd_lin_stop_ack_get(uint32_t lin_periph);

/* LIN dma */
/* Enable DMA TX function for LIN */
void linflexd_lin_dma_tx_enable(uint32_t lin_periph,linflexd_dma_tx_channel_enum dma);
/* Disable DMA TX function for LIN */
void linflexd_lin_dma_tx_disable(uint32_t lin_periph,linflexd_dma_tx_channel_enum dma);
/* Enable DMA RX function for LIN */
void linflexd_lin_dma_rx_enable(uint32_t lin_periph,linflexd_dma_rx_channel_enum dma);
/* Disable DMA RX function for LIN */
void linflexd_lin_dma_rx_disable(uint32_t lin_periph,linflexd_dma_rx_channel_enum dma);

/* interrupt & flag functions */
/* Get LIN status flag */
FlagStatus linflexd_lin_flag_get(uint32_t lin_periph, linflexd_flag_enum flag);
/* Clear LIN status flag */
void linflexd_lin_flag_clear(uint32_t lin_periph, linflexd_flag_enum flag);
/* Enable interrupt */
void linflexd_lin_interrupt_enable(uint32_t lin_periph, linflexd_interrupt_enum interrupt);
/* Disable interrupt */
void linflexd_lin_interrupt_disable(uint32_t lin_periph, linflexd_interrupt_enum interrupt);
/* Get LIN interrupt flag status */
FlagStatus linflexd_lin_interrupt_flag_get(uint32_t lin_periph, linflexd_interrupt_flag_enum flag);
/* Clear LIN interrupt flag */
void linflexd_lin_interrupt_flag_clear(uint32_t lin_periph,linflexd_interrupt_flag_enum flag);

#endif /* GD32A7XX_LINFLEXD_LIN_H */
